<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <meta name="renderer" content="webkit">
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <link rel="dns-prefetch" href="http://yoursite.com">
  <title>马来有趣的一些事儿 | Wicky&#39;s Blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8DDD;&amp;#x79BB;&amp;#x4ECE;&amp;#x9A6C;&amp;#x6765;&amp;#x56DE;&amp;#x6765;&amp;#x5DF2;&amp;#x7ECF;&amp;#x5DEE;&amp;#x4E0D;&amp;#x591A;&amp;#x4E24;&amp;#x4E2A;&amp;#x6708;&amp;#x4E86;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x6CA1;&amp;#x65F6;&amp;#x95F4;&amp;#x53BB;&amp;#x6574;&amp;#x7406;">
<meta property="og:type" content="article">
<meta property="og:title" content="马来有趣的一些事儿">
<meta property="og:url" content="http://yoursite.com/2016/12/12/马来有趣的一些事儿/index.html">
<meta property="og:site_name" content="Wicky's Blog">
<meta property="og:description" content="&amp;#x8DDD;&amp;#x79BB;&amp;#x4ECE;&amp;#x9A6C;&amp;#x6765;&amp;#x56DE;&amp;#x6765;&amp;#x5DF2;&amp;#x7ECF;&amp;#x5DEE;&amp;#x4E0D;&amp;#x591A;&amp;#x4E24;&amp;#x4E2A;&amp;#x6708;&amp;#x4E86;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x6CA1;&amp;#x65F6;&amp;#x95F4;&amp;#x53BB;&amp;#x6574;&amp;#x7406;">
<meta property="og:image" content="http://yoursite.com/2016/12/12/马来有趣的一些事儿/child.jpg">
<meta property="og:image" content="http://yoursite.com/2016/12/12/马来有趣的一些事儿/george.jpg">
<meta property="og:image" content="http://yoursite.com/2016/12/12/马来有趣的一些事儿/Jeremy.jpg">
<meta property="og:updated_time" content="2016-12-13T16:56:41.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="马来有趣的一些事儿">
<meta name="twitter:description" content="&amp;#x8DDD;&amp;#x79BB;&amp;#x4ECE;&amp;#x9A6C;&amp;#x6765;&amp;#x56DE;&amp;#x6765;&amp;#x5DF2;&amp;#x7ECF;&amp;#x5DEE;&amp;#x4E0D;&amp;#x591A;&amp;#x4E24;&amp;#x4E2A;&amp;#x6708;&amp;#x4E86;&amp;#xFF0C;&amp;#x4E00;&amp;#x76F4;&amp;#x6CA1;&amp;#x65F6;&amp;#x95F4;&amp;#x53BB;&amp;#x6574;&amp;#x7406;">
<meta name="twitter:image" content="http://yoursite.com/2016/12/12/马来有趣的一些事儿/child.jpg">
  
    <link rel="alternative" href="/atom.xml" title="Wicky&#39;s Blog" type="application/atom+xml">
  
  
    <link rel="icon" href="/source/img/favicon.png">
  
  <link rel="stylesheet" href="/main.css?v=4.0.0.css">
  

</head>

<body>
  <div id="container" q-class="show:isCtnShow">
    <canvas id="anm-canvas" class="anm-canvas"></canvas>
    <div class="left-col" q-class="show:isShow">
      <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			<img src="https://avatars3.githubusercontent.com/u/9361738?v=3&amp;s=460" class="js-avatar">
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">Wicky</a></h1>
		</hgroup>

		
		<p class="header-subtitle">Just Do IT.</p>
		

		<nav class="header-menu">
			<ul>
			
				<li><a href="/">主页</a></li>
	        
				<li><a href="/categories/学习/">学习</a></li>
	        
				<li><a href="/categories/编程/">编程</a></li>
	        
				<li><a href="/categories/随笔/">随笔</a></li>
	        
			</ul>
		</nav>
		<nav class="header-smart-menu">
	        
    		
    			
    			<a data-idx="0" q-on="click: openSlider(e, 'innerArchive')" href="javascript:void(0)">所有文章</a>
    			
    			
            
    			
    			<a data-idx="1" q-on="click: openSlider(e, 'aboutme')" href="javascript:void(0)">关于我</a>
    			
    			
            
		</nav>
		<nav class="header-nav">
			<div class="social">
				
					<a class="github" target="_blank" href="https://github.com/WickyLeo" title="github"><i class="icon-github"></i></a>
		        
					<a class="weibo" target="_blank" href="#" title="weibo"><i class="icon-weibo"></i></a>
		        
					<a class="rss" target="_blank" href="#" title="rss"><i class="icon-rss"></i></a>
		        
					<a class="mail" target="_blank" href="mailto:wickyliao1993@gmail.com" title="mail"><i class="icon-mail"></i></a>
		        
			</div>
		</nav>
	</header>		
</div>

    </div>
    <div class="mid-col" q-class="show:isShow,hide:isShow|isFalse">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"><i class="icon-sort"></i></div>
  		<h1 class="header-author js-mobile-header hide">Wicky</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				<img src="https://avatars3.githubusercontent.com/u/9361738?v=3&amp;s=460" class="js-avatar">
			</div>
			<hgroup>
			  <h1 class="header-author">Wicky</h1>
			</hgroup>
			
			<p class="header-subtitle">Just Do IT.</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/categories/学习/">学习</a></li>
		        
					<li><a href="/categories/编程/">编程</a></li>
		        
					<li><a href="/categories/随笔/">随笔</a></li>
		        
		        
		        	<li><a href="/archives/">所有文章</a></li>
		        
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/WickyLeo" title="github"><i class="icon-github"></i></a>
			        
						<a class="weibo" target="_blank" href="#" title="weibo"><i class="icon-weibo"></i></a>
			        
						<a class="rss" target="_blank" href="#" title="rss"><i class="icon-rss"></i></a>
			        
						<a class="mail" target="_blank" href="mailto:wickyliao1993@gmail.com" title="mail"><i class="icon-mail"></i></a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div id="wrapper" class="body-wrap">
        <div class="menu-l">
          <div class="canvas-wrap">
            <canvas data-colors="#eaeaea" data-sectionHeight="100" data-contentId="js-content" id="myCanvas1" class="anm-canvas"></canvas>
          </div>
          <div id="js-content" class="content-ll">
            <article id="post-马来有趣的一些事儿" class="article article-type-post " itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      马来有趣的一些事儿
    </h1>
  

        <a href="/2016/12/12/马来有趣的一些事儿/" class="archive-article-date">
  	<time datetime="2016-12-11T17:20:19.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-12-12</time>
</a>
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x8DDD;&#x79BB;&#x4ECE;&#x9A6C;&#x6765;&#x56DE;&#x6765;&#x5DF2;&#x7ECF;&#x5DEE;&#x4E0D;&#x591A;&#x4E24;&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x4E00;&#x76F4;&#x6CA1;&#x65F6;&#x95F4;&#x53BB;&#x6574;&#x7406;&#x9A6C;&#x6765;&#x7684;&#x6E38;&#x8BB0;(&#x5176;&#x5B9E;&#x662F;&#x56E0;&#x4E3A;&#x61D2;&#x1F440; )&#xFF0C;&#x518D;&#x4E09;&#x56DE;&#x60F3;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x51E0;&#x4EF6;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x513F;&#x503C;&#x5F97;&#x8BB0;&#x5F55;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x4E0D;&#x82B1;&#x65F6;&#x95F4;&#x8D58;&#x8FF0;&#xFF0C;&#x7A0D;&#x5FAE;&#x7559;&#x4E0B;&#x70B9;&#x6587;&#x5B57;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<h2 id="&#x4ED9;&#x672C;&#x90A3;&#x9A6C;&#x5E03;&#x5C9B;&#x7684;&#x5C0F;&#x5B69;"><a href="#&#x4ED9;&#x672C;&#x90A3;&#x9A6C;&#x5E03;&#x5C9B;&#x7684;&#x5C0F;&#x5B69;" class="headerlink" title="&#x4ED9;&#x672C;&#x90A3;&#x9A6C;&#x5E03;&#x5C9B;&#x7684;&#x5C0F;&#x5B69;"></a>&#x4ED9;&#x672C;&#x90A3;&#x9A6C;&#x5E03;&#x5C9B;&#x7684;&#x5C0F;&#x5B69;</h2><p><img src="/2016/12/12/&#x9A6C;&#x6765;&#x6709;&#x8DA3;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x513F;/child.jpg" alt="logo"><br>&#x9A6C;&#x5E03;&#x5C9B;&#x4F4D;&#x4E8E;&#x4ED9;&#x672C;&#x90A3;&#x7684;&#x4E1C;&#x5357;&#x65B9;&#x5411;&#xFF0C;&#x5C9B;&#x4E0A;&#x5927;&#x6982;&#x6709;2000&#x4EBA;&#xFF0C;&#x4F46;&#x662F;&#x5E03;&#x4F9D;&#x65CF;&#x8001;&#x4EBA;&#x548C;&#x5C0F;&#x5B69;&#x5F88;&#x591A;&#xFF0C;&#x6D77;&#x4E0A;&#x7684;&#x5409;&#x666E;&#x8D5B;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5C9B;&#x4E0A;&#x4F4F;&#x4E86;&#x4E09;&#x5929;&#xFF0C;&#x5728;&#x6700;&#x540E;&#x4E00;&#x5929;&#x8981;&#x79BB;&#x5F00;&#x7684;&#x65F6;&#x5019;&#x624D;&#x51B3;&#x5B9A;&#x4E0A;&#x5C9B;&#x4E0A;&#x8F6C;&#x8F6C;&#xFF0C;&#x5C9B;&#x4E0A;&#x5F88;&#x7834;&#x65E7;&#xFF0C;&#x57FA;&#x672C;&#x548C;&#x8D2B;&#x6C11;&#x7A9F;&#x5DEE;&#x4E0D;&#x591A;&#x3002;<br>&#x5728;Uncle Chang&#x6C34;&#x5C4B;&#x65C1;&#x8FB9;&#x7684;&#x4E00;&#x5BB6;&#x5C0F;&#x5546;&#x5E97;&#x65C1;&#x8FB9;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x5C0F;&#x5B69;&#xFF0C;&#x4ED6;&#x7A7F;&#x7740;&#x7834;&#x70C2;&#x7684;&#x5DF4;&#x585E;&#x7F57;&#x90A3;&#x7403;&#x8863;&#xFF0C;&#x8EAB;&#x4E0A;&#x6302;&#x7740;&#x4E00;&#x628A;&#x7834;&#x65E7;&#x5E76;&#x4E14;&#x65AD;&#x4E86;&#x7684;&#x73A9;&#x5177;&#x67AA;&#xFF0C;&#x80CC;&#x4E0A;&#x4E5F;&#x6302;&#x4E86;&#x4E00;&#x628A;&#x65AD;&#x4E86;&#x7684;&#x73A9;&#x5177;&#x957F;&#x5251;&#xFF0C;&#x8138;&#x4E0A;&#x5219;&#x662F;&#x6234;&#x7740;&#x4E00;&#x4E2A;&#x6709;&#x7EB8;&#x58F3;&#x6233;&#x7A7F;&#x4E24;&#x4E2A;&#x6D1E;&#x513F;&#x505A;&#x6210;&#x7684;&#x9762;&#x5177;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C9B;&#x4E0A;&#x7684;&#x5C0F;&#x5B69;&#x513F;&#x4E0D;&#x591A;&#xFF0C;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x8FC7;&#x6765;&#x5C31;&#x4F38;&#x624B;&#x8981;Candy&#xFF0C;&#x867D;&#x7136;&#x5F88;&#x7A77;&#xFF0C;&#x4F46;&#x662F;&#x770B;&#x51FA;&#x4ED6;&#x4EEC;&#x4E5F;&#x8FD8;&#x5F88;&#x4E50;&#x89C2;&#xFF0C;&#x4FDD;&#x6301;&#x7740;&#x7AE5;&#x771F;&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x5F53;&#x65F6;&#x7684;&#x7AE5;&#x5E74;&#x5F88;&#x50CF;&#xFF0C;&#x6BD4;&#x8D77;&#x73B0;&#x5728;&#x5927;&#x57CE;&#x5E02;&#x91CC;&#x5B69;&#x5B50;&#x7684;&#x5A07;&#x751F;&#x60EF;&#x517B;&#xFF0C;&#x4ED6;&#x4EEC;&#x6216;&#x8BB8;&#x771F;&#x7684;&#x662F;&#x5FEB;&#x4E50;&#x7684;&#x5427;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x4E9A;&#x5E87;&#x7684;&#x9752;&#x65C5;&#x8001;&#x677F;"><a href="#&#x4E9A;&#x5E87;&#x7684;&#x9752;&#x65C5;&#x8001;&#x677F;" class="headerlink" title="&#x4E9A;&#x5E87;&#x7684;&#x9752;&#x65C5;&#x8001;&#x677F;"></a>&#x4E9A;&#x5E87;&#x7684;&#x9752;&#x65C5;&#x8001;&#x677F;</h2><p>&#x5728;&#x4E9A;&#x5E87;&#x4F4F;&#x7684;&#x9752;&#x65C5;&#x53EB;&#x597D;&#x671B;&#x89D2;&#xFF0C;&#x8001;&#x677F;96&#x5E74;&#x751F;&#x4EBA;&#xFF0C;&#x548C;&#x4ED6;&#x5AB3;&#x5987;&#x513F;&#x4E24;&#x4EBA;&#x7ECF;&#x8425;&#x7740;&#x8FD9;&#x5BB6;&#x9752;&#x65C5;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4ED6;&#x5BB6;&#x4F4F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8001;&#x677F;&#x5A18;&#x56DE;&#x56FD;&#x73A9;&#x53BB;&#x4E86;&#xFF0C;&#x8001;&#x677F;&#x5929;&#x5929;&#x7A9D;&#x5728;&#x5BB6;&#x6253;&#x6E38;&#x620F;&#xFF0C;&#x665A;&#x4E0A;12&#x70B9;&#x5C31;&#x51FA;&#x53BB;&#x5916;&#x9762;&#x7684;&#x9152;&#x5427;&#x73A9;&#xFF0C;&#x5230;&#x7B2C;&#x4E8C;&#x5929;&#x65E9;&#x4E0A;&#x56DE;&#x6765;&#x4E86;&#xFF0C;&#x518D;&#x7761;&#x5230;&#x4E2D;&#x5348;&#x8D77;&#x5E8A;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x8BF4;&#x4ED6;&#x6709;&#x8DA3;&#xFF0C;&#x5728;&#x4ED6;&#x8FD9;&#x4E2A;&#x5E74;&#x7EAA;&#x7ADF;&#x7136;&#x5C31;&#x8FC7;&#x4E0A;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4E5F;&#x8FD8;&#x4E0D;&#x9519;&#x3002;</p>
<h2 id="&#x69DF;&#x57CE;&#x7684;&#x51FA;&#x79DF;&#x8F66;&#x5E08;&#x5085;"><a href="#&#x69DF;&#x57CE;&#x7684;&#x51FA;&#x79DF;&#x8F66;&#x5E08;&#x5085;" class="headerlink" title="&#x69DF;&#x57CE;&#x7684;&#x51FA;&#x79DF;&#x8F66;&#x5E08;&#x5085;"></a>&#x69DF;&#x57CE;&#x7684;&#x51FA;&#x79DF;&#x8F66;&#x5E08;&#x5085;</h2><p><img src="/2016/12/12/&#x9A6C;&#x6765;&#x6709;&#x8DA3;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x513F;/george.jpg" alt="logo"><br>&#x69DF;&#x57CE;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x827A;&#x6C14;&#x606F;&#x5F88;&#x91CD;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x548C;&#x56FD;&#x5185;&#x7684;&#x9F13;&#x6D6A;&#x5C7F;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x6700;&#x51FA;&#x540D;&#x7684;&#x5927;&#x6982;&#x5C31;&#x662F;&#x5728;2012&#x5E74;&#x5DE6;&#x53F3;&#x7531;&#x5317;&#x6B27;&#x7684;&#x9752;&#x5E74;&#x753B;&#x5BB6;&#x8054;&#x5408;&#x4E00;&#x6279;&#x521B;&#x4F5C;&#x8005;&#xFF0C;&#x5728;&#x8FD9;&#x5EA7;&#x57CE;&#x5E02;&#x7684;&#x591A;&#x4E2A;&#x89D2;&#x843D;&#x753B;&#x4E0A;&#x4E86;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x57CE;&#x5E02;&#x70D9;&#x5370;&#x7684;&#x58C1;&#x753B;&#xFF0C;&#x8FD9;&#x4E5F;&#x5BFC;&#x81F4;&#x5F88;&#x591A;&#x6587;&#x827A;&#x9752;&#x5E74;&#x6155;&#x540D;&#x800C;&#x6765;&#x5BFB;&#x627E;&#x5B83;&#x4EEC;&#x3002;<br>&#x6211;&#x4EEC;&#x62B5;&#x8FBE;&#x69DF;&#x57CE;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x5728;&#x665A;&#x4E0A;12&#x70B9;&#x591A;&#xFF0C;&#x5230;&#x8FBE;&#x9752;&#x65C5;&#x540E;&#x5C31;&#x76F4;&#x63A5;&#x529E;&#x7406;&#x5165;&#x4F4F;&#x4E86;&#x3002;&#x7B2C;&#x4E8C;&#x5929;&#x4E00;&#x65E9;6&#x70B9;&#x5C31;&#x8D77;&#x5E8A;&#x5BFB;&#x627E;&#x58C1;&#x753B;&#xFF0C;&#x5728;&#x53BB;&#x5F80;&#x5468;&#x59D3;&#x6865;&#x7684;&#x8DEF;&#x4E0A;&#x9047;&#x4E0A;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4EBA;&#x3002;<br>&#x69DF;&#x57CE;&#x53C8;&#x53EB;GeorgeTown,&#x91CC;&#x9762;&#x7684;&#x534E;&#x4EBA;&#x975E;&#x5E38;&#x591A;,&#x6F2B;&#x6B65;&#x8005;&#x69DF;&#x57CE;&#x8857;&#x5934;&#xFF0C;&#x6162;&#x6162;&#x7684;&#x6C49;&#x5B57;&#x548C;&#x4E2D;&#x6587;&#x62DB;&#x724C;&#x4EFF;&#x4F5B;&#x5728;&#x544A;&#x8BC9;&#x4F60;&#x4E0D;&#x662F;&#x5728;&#x56FD;&#x5916;&#xFF0C;&#x65E9;&#x5E74;&#x4E0B;&#x5357;&#x6D0B;&#x7684;&#x4E2D;&#x56FD;&#x4EBA;&#x521B;&#x529E;&#x4E86;&#x672C;&#x5730;&#x7684;&#x5F88;&#x591A;&#x5546;&#x4E1A;&#x5316;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5176;&#x4E2D;&#x9001;&#x6211;&#x4EEC;&#x53BB;&#x673A;&#x573A;&#x7684;&#x6885;&#x5148;&#x751F;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4ED6;&#x548C;&#x4ED6;&#x7684;&#x5F1F;&#x5F1F;&#x51FA;&#x751F;&#x5728;&#x9A6C;&#x6765;&#x897F;&#x4E9A;&#xFF0C;&#x4ECE;&#x5C0F;&#x5728;&#x69DF;&#x57CE;&#x957F;&#x5927;&#xFF0C;&#x5230;&#x73B0;&#x5728;40&#x591A;&#x5E74;&#x90FD;&#x6CA1;&#x6709;&#x79BB;&#x5F00;&#x8FC7;&#x8FD9;&#x91CC;&#xFF0C;&#x4ED6;&#x8DDF;&#x6211;&#x8BF4;&#x4ED6;&#x7684;&#x68A6;&#x60F3;&#x5C31;&#x662F;&#x8981;&#x81EA;&#x5DF1;&#x5F00;&#x7740;&#x8F66;&#x4ECE;&#x9A6C;&#x6765;&#x897F;&#x4E9A;&#x7ECF;&#x8FC7;&#x6CF0;&#x56FD;&#x3001;&#x7F05;&#x7538;&#xFF0C;&#x6700;&#x540E;&#x4ECE;&#x4E91;&#x5357;&#x5165;&#x5883;&#x5230;&#x4E2D;&#x56FD;&#xFF0C;&#x4ED6;&#x68A6;&#x60F3;&#x8FD9;&#x53BB;&#x4E00;&#x6B21;&#x6606;&#x660E;&#xFF0C;&#x4ED6;&#x8BF4;&#x60F3;&#x5728;&#x6709;&#x751F;&#x4E4B;&#x5E74;&#x80FD;&#x81EA;&#x5DF1;&#x5F00;&#x7740;&#x8F66;&#x56DE;&#x5230;&#x7956;&#x56FD;&#x770B;&#x770B;&#xFF0C;&#x4ED6;&#x4E0D;&#x76F8;&#x4FE1;&#x98DE;&#x673A;&#xFF0C;&#x4ED6;&#x89C9;&#x5F97;&#x98DE;&#x673A;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x4ED6;&#x8FD8;&#x662F;&#x4FE1;&#x4EFB;&#x81EA;&#x5DF1;&#x7684;&#x9A7E;&#x9A76;&#x6280;&#x672F;&#xFF0C;&#x4ED6;&#x8BF4;&#x7B49;&#x4ED6;&#x8D5A;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x94B1;&#x5C31;&#x65B0;&#x4E70;&#x4E00;&#x8F86;&#x8F66;&#x53BB;&#x5B8C;&#x6210;&#x4ED6;&#x7684;&#x68A6;&#x60F3;&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x4E00;&#x5B9A;&#x8981;&#x7559;&#x4E0B;&#x6211;&#x5728;&#x5317;&#x4EAC;&#x7684;&#x53F7;&#x7801;&#xFF0C;&#x4E5F;&#x7ED9;&#x4E86;&#x6211;&#x7684;&#x4ED6;&#x7684;&#x540D;&#x7247;&#xFF0C;&#x8BA9;&#x6211;&#x4E00;&#x5B9A;&#x8981;&#x8054;&#x7CFB;&#x4ED6;&#x3002;<br>&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x5927;&#x53D4;&#x80FD;&#x65E9;&#x65E5;&#x5B9E;&#x73B0;&#x4ED6;&#x7684;&#x68A6;&#x60F3;&#x3002;</p>
<h2 id="&#x5170;&#x5361;&#x5A01;&#x7684;&#x5149;&#x5934;&#x8001;&#x677F;-Jeremy"><a href="#&#x5170;&#x5361;&#x5A01;&#x7684;&#x5149;&#x5934;&#x8001;&#x677F;-Jeremy" class="headerlink" title="&#x5170;&#x5361;&#x5A01;&#x7684;&#x5149;&#x5934;&#x8001;&#x677F; - Jeremy"></a>&#x5170;&#x5361;&#x5A01;&#x7684;&#x5149;&#x5934;&#x8001;&#x677F; - Jeremy</h2><p><img src="/2016/12/12/&#x9A6C;&#x6765;&#x6709;&#x8DA3;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x513F;/Jeremy.jpg" alt="logo"><br>&#x5170;&#x5361;&#x5A01;&#x53C8;&#x540D;&#x6D6E;&#x7F57;&#x4EA4;&#x6021;&#xFF0C;&#x4F4D;&#x4E8E;&#x9A6C;&#x6765;&#x897F;&#x4E9A;&#x7684;&#x897F;&#x8FB9;&#xFF0C;&#x8DDD;&#x79BB;&#x6CF0;&#x56FD;&#x5F88;&#x8FD1;&#xFF0C;&#x636E;&#x8BF4;&#x6709;&#x4E9B;&#x6CF0;&#x56FD;&#x4EBA;&#x901A;&#x8FC7;&#x6E38;&#x6CF3;&#x5077;&#x6E21;&#x5230;&#x8FD9;&#x8FB9;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x771F;&#x662F;&#x5047;&#x3002;<br>&#x5728;&#x5170;&#x5361;&#x5A01;&#x4F4F;&#x7684;EI Studio&#x662F;&#x4E00;&#x5BB6;&#x97F3;&#x4E50;&#x5DE5;&#x4F5C;&#x5BA4;&#x6539;&#x7F16;&#x800C;&#x6210;&#x7684;&#x9752;&#x65C5;&#xFF0C;&#x8001;&#x677F;Jeremy88&#x5E74;&#x751F;&#x4EBA;&#xFF0C;&#x548C;&#x4ED6;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4F4D;&#x5149;&#x5934;&#x670B;&#x53CB;Fernando&#x4E00;&#x8D77;&#x7ECF;&#x8425;&#x7740;&#x8FD9;&#x5BB6;&#x9752;&#x65C5;&#x3002;&#x8001;&#x677F;&#x7684;&#x5409;&#x4ED6;&#x5F39;&#x5F97;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x6709;&#x4E00;&#x5929;&#x4E0B;&#x5348;&#x5728;&#x5348;&#x7761;&#x7684;&#x65F6;&#x5019;&#x542C;&#x5230;&#x4E86;&#x4ED6;&#x72EC;&#x81EA;&#x4E00;&#x4EBA;&#x5728;Solo&#xFF0C;&#x8C08;&#x7684;&#x975E;&#x5E38;&#x52A8;&#x542C;&#xFF0C;&#x548C;&#x4ED6;&#x804A;&#x5929;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x77E5;&#x9053;&#x4ED6;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x68A6;&#x60F3;&#x7684;&#x97F3;&#x4E50;&#x4EBA;&#xFF0C;&#x4ED6;&#x7684;&#x7238;&#x7238;&#x662F;&#x8461;&#x8404;&#x7259;&#x4EBA;&#xFF0C;&#x5988;&#x5988;&#x662F;&#x534E;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x4ECE;&#x5C0F;&#x4ED6;&#x5728;&#x534E;&#x6587;&#x5B66;&#x6821;&#x957F;&#x5927;&#xFF0C;&#x82F1;&#x6587;&#x3001;&#x4E2D;&#x6587;&#x8BF4;&#x7684;&#x90FD;&#x5F88;&#x597D;&#x3002;&#x5170;&#x5361;&#x5A01;&#x662F;&#x4ED6;&#x7684;&#x6545;&#x4E61;&#xFF0C;&#x4ED6;&#x7684;&#x7237;&#x7237;&#x5976;&#x5976;&#x5728;&#x8FD9;&#x751F;&#x6D3B;&#x3002;&#x548C;&#x4ED6;&#x8C08;&#x8BBA;&#x8D77;&#x5927;&#x57CE;&#x5E02;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4ED6;&#x8BF4;&#x65E9;&#x51E0;&#x5E74;&#x5728;&#x5409;&#x9686;&#x5761;&#x4E0A;&#x5B66;&#x548C;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x5988;&#x5988;&#x8BF4;&#x4ED6;&#x7684;&#x8138;&#x4E0A;&#x4ECE;&#x6765;&#x5C31;&#x6CA1;&#x6709;&#x8FC7;&#x7B11;&#x5BB9;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x653E;&#x5F03;&#x4E86;&#x5927;&#x57CE;&#x5E02;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x6765;&#x5230;&#x5170;&#x5361;&#x5A01;&#x8FC7;&#x4E0A;&#x9752;&#x65C5;&#x8001;&#x677F;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4ED6;&#x5728;&#x505A;&#x97F3;&#x4E50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x66FE;&#x7ECF;&#x4E5F;&#x53BB;&#x8FC7;&#x5317;&#x4EAC;&#x3001;&#x4E0A;&#x6D77;&#x505A;&#x8FC7;&#x6D41;&#x6D6A;&#x6B4C;&#x624B;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x5728;&#x4E2D;&#x5173;&#x6751;&#x65B0;&#x4E2D;&#x5173;&#x5927;&#x53A6;&#x95E8;&#x53E3;&#x9A7B;&#x5531;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x8FD8;&#x89C1;&#x8FC7;&#x9762;&#x3002;<br>Jeremy&#x662F;&#x4E2A;&#x5F88;&#x53CB;&#x5584;&#x7684;&#x4EBA;&#xFF0C;&#x5E0C;&#x671B;&#x4ED6;&#x7684;&#x97F3;&#x4E50;&#x68A6;&#x60F3;&#x80FD;&#x6210;&#x529F;&#x3002;</p>
<p>&#x65C5;&#x884C;&#x5C31;&#x662F;&#x5728;&#x8DEF;&#x4E0A;&#xFF0C;&#x53D1;&#x73B0;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x9047;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#xFF0C;&#x770B;&#x6CA1;&#x6709;&#x89C1;&#x8FC7;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x6709;&#x65F6;&#x98CE;&#x666F;&#x662F;&#x7F8E;&#x7684;&#xFF0C;&#x6709;&#x4E8B;&#x4EBA;&#x662F;&#x66F4;&#x7F8E;&#x7684;&#xFF0C;&#x4EBA;&#x751F;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#x5C31;&#x662F;&#x5728;&#x4E00;&#x6B21;&#x4E00;&#x6B21;&#x7684;&#x65C5;&#x884C;&#x4E2D;&#x6084;&#x7136;&#x6539;&#x53D8;&#xFF0C;&#x539F;&#x6765;&#x8FD8;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x7684;&#x811A;&#x6B65;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x505C;&#x6B47;&#x3002;</p>

      

      
        <div class="page-reward">
          <a href="javascript:;" class="page-reward-btn tooltip-top">
            <div class="tooltip tooltip-east">
            <span class="tooltip-item">
              赏
            </span>
            <span class="tooltip-content">
              <span class="tooltip-text">
                <span class="tooltip-inner">
                  <p class="reward-p"><i class="icon icon-quo-left"></i>谢谢你请我吃糖果<i class="icon icon-quo-right"></i></p>
                  <div class="reward-box">
                    
                    
                  </div>
                </span>
              </span>
            </span>
          </div>
          </a>
        </div>
      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/旅行/">旅行</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/马来西亚/">马来西亚</a></li></ul>
	</div>

      
	<div class="article-category tagcloud">
	<i class="icon-book icon"></i>
	<a class="article-category-link" href="/categories/随笔/">随笔</a>
	</div>


      

      
        
<div class="share-btn share-icons tooltip-left">
  <div class="tooltip tooltip-east">
    <span class="tooltip-item">
      <a href="javascript:;" class="share-sns share-outer">
        <i class="icon icon-share"></i>
      </a>
    </span>
    <span class="tooltip-content">
      <div class="share-wrap">
        <div class="share-icons">
          <a class="weibo share-sns" href="javascript:;" data-type="weibo">
            <i class="icon icon-weibo"></i>
          </a>
          <a class="weixin share-sns wxFab" href="javascript:;" data-type="weixin">
            <i class="icon icon-weixin"></i>
          </a>
          <a class="qq share-sns" href="javascript:;" data-type="qq">
            <i class="icon icon-qq"></i>
          </a>
          <a class="douban share-sns" href="javascript:;" data-type="douban">
            <i class="icon icon-douban"></i>
          </a>
          <a class="qzone share-sns" href="javascript:;" data-type="qzone">
            <i class="icon icon-qzone"></i>
          </a>
          <a class="facebook share-sns" href="javascript:;" data-type="facebook">
            <i class="icon icon-facebook"></i>
          </a>
          <a class="twitter share-sns" href="javascript:;" data-type="twitter">
            <i class="icon icon-twitter"></i>
          </a>
          <a class="google share-sns" href="javascript:;" data-type="google">
            <i class="icon icon-google"></i>
          </a>
        </div>
      </div>
    </span>
  </div>
</div>

<div class="page-modal wx-share js-wx-box">
    <a class="close js-modal-close" href="javascript:;"><i class="icon icon-close"></i></a>
    <p>扫一扫，分享到微信</p>
    <div class="wx-qrcode">
      <img src="http://s.jiathis.com/qrcode.php?url=http://yoursite.com/2016/12/12/马来有趣的一些事儿/" alt="微信分享二维码">
    </div>
</div>

<div class="mask js-mask"></div>
      
      <div class="clearfix"></div>
    </div>
  </div>
</article>

  
<nav id="article-nav">
  
    <a href="/2016/12/14/Kafka-MQ的一些想法/" id="article-nav-newer" class="article-nav-link-wrap">
      <i class="icon-circle-left"></i>
      <div class="article-nav-title">
        
          Kafka MQ的一些想法
        
      </div>
    </a>
  
  
    <a href="/2016/12/11/解决gitlab、github多账户生成rsa-key覆盖的问题/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">解决gitlab、github多账户生成rsa key覆盖的问题</div>
      <i class="icon-circle-right"></i>
    </a>
  
</nav>





  
  <section id="comments">
    <!-- 多说评论框 start -->
    <div class="ds-thread" data-thread-key="post-马来有趣的一些事儿" data-title="马来有趣的一些事儿" data-url="http://yoursite.com/2016/12/12/马来有趣的一些事儿/"></div>
    <!-- 多说评论框 end -->
    <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
    <script type="text/javascript">
    var duoshuoQuery = {short_name:'wickyleo'};
      (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0] 
         || document.getElementsByTagName('body')[0]).appendChild(ds);
      })();
      </script>
    <!-- 多说公共JS代码 end -->
  </section>
  

          </div>
        </div>
      </div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2016 Wicky
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    <script>
	var yiliaConfig = {
		mathjax: false,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: "/",
		innerArchive: true
	}
</script>

<script src="/./main.js?v=4.0.0.js"></script>


    
<div class="tools-col" q-class="show:isShow,hide:isShow|isFalse" q-on="click:stop(e)">
  <div class="tools-wrap">
    
    	<section class="tools-section tools-section-all" q-show="innerArchive">
        <div class="search-wrap">
          <input class="search-ipt" q-model="search" type="text" placeholder="find something…">
          <i class="icon-search icon" q-show="search|isEmptyStr"></i>
          <i class="icon-close icon" q-show="search|isNotEmptyStr" q-on="click:clearChose(e)"></i>
        </div>
        <div class="widget tagcloud search-tag">
          <p class="search-tag-wording">tag:</p>
          <label class="search-switch">
            <input type="checkbox" q-on="click:toggleTag(e)" q-attr="checked:showTags">
          </label>
          <ul class="article-tag-list" q-show="showTags">
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">Python</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">语音</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">Hexo</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">马来西亚</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">旅行</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">Kafka</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">MQ</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">github</a>
              </li>
            
            <div class="clearfix"></div>
          </ul>
        </div>
        <ul class="search-ul">
          <p q-show="jsonFail" style="padding: 20px; font-size: 12px;">
            缺失模块。<br/>1、在博客根目录（注意不是yilia根目录）执行以下命令：<br/> npm i hexo-generator-json-content --save<br/><br/>
            2、在根目录_config.yml里添加配置：
<pre style="font-size: 12px;" q-show="jsonFail">
  jsonContent:
    meta: false
    pages: false
    posts:
      title: true
      date: true
      path: true
      text: true
      raw: false
      content: false
      slug: false
      updated: false
      comments: false
      link: false
      permalink: false
      excerpt: false
      categories: false
      tags: true
</pre>
          </p>
          <li class="search-li" q-repeat="items" q-show="isShow">
            <a q-attr="href:path|urlformat" class="search-title"><i class="icon-quo-left icon"></i><span q-text="title"></span></a>
            <p class="search-time">
              <i class="icon-calendar icon"></i>
              <span q-text="date|dateformat"></span>
            </p>
            <p class="search-tag">
              <i class="icon-price-tags icon"></i>
              <span q-repeat="tags" q-on="click:choseTag(e, name)" q-text="name|tagformat"></span>
            </p>
          </li>
        </ul>
    	</section>
    

    

    
    	<section class="tools-section tools-section-me" q-show="aboutme">
  	  	
  	  		<div class="aboutme-wrap" id="js-aboutme">一只奔跑在路上的小码农&lt;br&gt; 热爱生活、爱摄影、爱旅行&lt;br&gt;</div>
  	  	
    	</section>
    
  </div>
  
</div>
    <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>
  </div>
</body>
</html>